BIG-28.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session Spark SQL
#+PROPERTY: header-args:ipython :session Spark SQL
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:nil ^:nil _:nil tags:not-in-toc
#+TITLE: Spark SQL-1
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


  RDD is like the fundamental abstraction of SPARK, SQL is a new way of working
  with SPARK, and generally recommended for the end-user. why we need SQL,
  because SQL is a *higher-level abstaction* with more *optimization of RDDs*.
  The power of RDD is it can hold any data,which has the flexible functions
  apply on them, BUUUT more information and tech details you need to handle:

  | partitions                | need more optimization |
  | transform vs. action      | need more optimization |
  | when to cache             | need more information  |
  | shuffle or not            | need more information  |
  | type of RDD,what's inside | need more information  |

  SQL and the API gives *more information* you're working with, and it allowes
  to do many *optimization*, these come from research in *Database*.

* DataFrame and DataSet[T]
  in original spark.SQL a type called ~DataFrame~, it was kind of a
  *replacement* as far as the end-user was concerned for an *RDDs*:

  #+BEGIN_SRC scala
  type DataFrame = Dataset[Row]
  #+END_SRC

  BUUUT, DataFrame is just "looks" like RDDs, significant different underneath
  the hood.
** Row is not type safe, RDDs is type safe
   which means spark.SQL and DataFrames can not checked at compile time.

   As you can see, *DataFrame* work with Rows, *Row* they hold a row of data in
   a way that is *not necessarily type safe* and this is one reason why
   *DataFrame* are somewhat *significant deviation* from the *RDDs* and from
   kind of the general way that *scala* approaches, scala typically tries to
   make everything *type safe*

** DataFrame of SparkSession, RDDs of SparkContext

   BTW, SparkSesion is not the replacement of SparkContext, and you can get the
   DataFrame's related SparkContext from the SparkSesion

   #+BEGIN_SRC scala
     val sparkContext: SparkContext
     //The Spark context associated with this Spark session.
   #+END_SRC

   | RDD                            | DataFraem                           |                                            |
   |--------------------------------+-------------------------------------+--------------------------------------------|
   | type safe                      | not type safe                       |                                            |
   |--------------------------------+-------------------------------------+--------------------------------------------|
   | SparkConf.setAppName.setMaster | SparkSession.builder.master.appName |                                            |
   | -> SparkContext                | -> Builder.getOrCreate              |                                            |
   |                                | -> SparkSeesion                     |                                            |
   |--------------------------------+-------------------------------------+--------------------------------------------|
   |                                |                                     | case class StructType(Array[StructField])  |
   |                                |                                     | case class StructField(arg1,arg2,arg3,ag4) |
   |                                |                                     | newscheam: StructType(Array[StructField])  |
   |--------------------------------+-------------------------------------+--------------------------------------------|
   | sc.textFile                    | ss.read                             | ss.read                                    |
   | -> RDD[String]                 |                                     | -> DataFrameReader.schema(StructType)      |
   |                                |                                     | -> DataFrameReader.option(key, value)      |
   |--------------------------------+-------------------------------------+--------------------------------------------|
   |                                | -> DataFrameReader.csv(filePath)    | -> DataFrameReader.csv(filePath)           |
   |                                | -> DataFrame.show():Unit            | -> DataFrame.show():Unit                   |
   |--------------------------------+-------------------------------------+--------------------------------------------|
   |                                | -> DataFrame.schema                 | -> DataFrame.schema                        |
   |                                | -> StructType.printTreeString:Unit  | -> StructType.printTreeString:Unit         |
   |--------------------------------+-------------------------------------+--------------------------------------------|
   | sc.stop                        | bd.stop                             |                                            |


   #+BEGIN_SRC scala
     // SparkSeesion
     val spark = SparkSession
       .builder()
       .master("local[*]")
       .appName("NOAA Data")
       .getOrCreate()

     // SparkContext
     val sc = new SparkContext(new SparkConf()
                                 .setAppName("Temp Data")
                                 .setMaster("local[*]"))
   #+END_SRC
