BIG-28.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-10 五 00:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spark SQL-1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">Spark SQL-1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org219511d">DataFrame and DataSet[T]</a>
<ul>
<li><a href="#org817adec">Row is not type safe, RDDs is type safe</a></li>
<li><a href="#org4f7f006">DataFrame of SparkSession, RDDs of SparkContext</a></li>
<li><a href="#org62cb16f">DataFrame.show()</a></li>
<li><a href="#orge9d7522">DataFrame.schema and option</a>
<ul>
<li><a href="#orge7d3734">we can have multiple <code>option</code> s</a></li>
</ul>
</li>
<li><a href="#orgd24b8f3">df.select()</a></li>
<li><a href="#org60ca4b0">DataFrame.limit(n)</a></li>
<li><a href="#org22506f6">DataFrame.join(df, Seq(column1, column2, &#x2026;))</a></li>
<li><a href="#orgb4b9d39">DataFrame( or called DataSet[Column])</a></li>
<li><a href="#org185df00">DataFrame after filter mtype by "TMAX"</a></li>
<li><a href="#org6e8e4b2">DataFrame after filter mtype by "TMIN"</a></li>
<li><a href="#org29bd96e">DataFrame.describe()</a></li>
<li><a href="#org340c4c5">df.limit vs. df.drop</a></li>
<li><a href="#orge9d4ad3">df.select vs. df.filter vs. df.join</a></li>
<li><a href="#org7924e2b">df.stat</a></li>
</ul>
</li>
<li><a href="#orgaf8d0e3">StructType</a>
<ul>
<li><a href="#org9deb73e">StructType.printTreeString</a></li>
<li><a href="#org5ceb814">StructType(Array[StructField])</a></li>
</ul>
</li>
<li><a href="#org301e883">Column</a>
<ul>
<li><a href="#orgab9b015">Column construction</a></li>
<li><a href="#org7859bfe">Column operations</a>
<ul>
<li><a href="#org3367e75">return <code>Column</code></a></li>
<li><a href="#org2a237d9">element-vise</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3683f0e">DataFrameStatFunctions</a>
<ul>
<li><a href="#org46b13ba">from DataFrame to DataFrameStatFunctions</a></li>
<li><a href="#org3ceb12b">API intro</a></li>
</ul>
</li>
<li><a href="#org9559f8d">org.apache.spark.sql.functions</a></li>
</ul>
</div>
</div>
<p>
RDD is like the fundamental abstraction of SPARK, SQL is a new way of working
with SPARK, and generally recommended for the end-user. why we need SQL,
because SQL is a <b>higher-level abstaction</b> with more <b>optimization of RDDs</b>.
The power of RDD is it can hold any data,which has the flexible functions
apply on them, BUUUT more information and tech details you need to handle:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">partitions</td>
<td class="org-left">need more optimization</td>
</tr>

<tr>
<td class="org-left">transform vs. action</td>
<td class="org-left">need more optimization</td>
</tr>

<tr>
<td class="org-left">when to cache</td>
<td class="org-left">need more information</td>
</tr>

<tr>
<td class="org-left">shuffle or not</td>
<td class="org-left">need more information</td>
</tr>

<tr>
<td class="org-left">type of RDD,what's inside</td>
<td class="org-left">need more information</td>
</tr>
</tbody>
</table>

<p>
SQL and the API gives <b>more information</b> you're working with, and it allowes
to do many <b>optimization</b>, these come from research in <b>Database</b>.
</p>

<div id="org219511d" class="outline-2">
<h2 id="org219511d">DataFrame and DataSet[T]</h2>
<div class="outline-text-2" id="text-org219511d">
<p>
in original spark.SQL a type called <code>DataFrame</code>, it was kind of a
<b>replacement</b> as far as the end-user was concerned for an <b>RDDs</b>:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #a45bad;">DataFrame</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Dataset</span>[<span style="color: #a45bad;">Row</span>]
</pre>
</div>

<p>
BUUUT, DataFrame is just "looks" like RDDs, significant different underneath
the hood.
</p>
</div>
<div id="org817adec" class="outline-3">
<h3 id="org817adec">Row is not type safe, RDDs is type safe</h3>
<div class="outline-text-3" id="text-org817adec">
<p>
which means spark.SQL and DataFrames can not checked at compile time.
</p>

<p>
As you can see, <b>DataFrame</b> work with Rows, <b>Row</b> they hold a row of data in
a way that is <b>not necessarily type safe</b> and this is one reason why
<b>DataFrame</b> are somewhat <b>significant deviation</b> from the <b>RDDs</b> and from
kind of the general way that <b>scala</b> approaches, scala typically tries to
make everything <b>type safe</b>
</p>
</div>
</div>

<div id="org4f7f006" class="outline-3">
<h3 id="org4f7f006">DataFrame of SparkSession, RDDs of SparkContext</h3>
<div class="outline-text-3" id="text-org4f7f006">
<p>
BTW, SparkSesion is not the replacement of SparkContext, and you can get the
DataFrame's related SparkContext from the SparkSesion
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">sparkContext</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">SparkContext</span>
<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">The Spark context associated with this Spark session.</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">RDD</th>
<th scope="col" class="org-left">DataFraem</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">type safe</td>
<td class="org-left">not type safe</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SparkConf.setAppName.setMaster</td>
<td class="org-left">SparkSession.builder.master.appName</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">-&gt; SparkContext</td>
<td class="org-left">-&gt; Builder.getOrCreate</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">-&gt; SparkSeesion</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">case class StructType(Array[StructField])</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">case class StructField(arg1,arg2,arg3,ag4)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">newscheam: StructType(Array[StructField])</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">sc.textFile</td>
<td class="org-left">ss.read</td>
<td class="org-left">ss.read</td>
</tr>

<tr>
<td class="org-left">-&gt; RDD[String]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-&gt; DataFrameReader.schema(StructType)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-&gt; DataFrameReader.option(key, value)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">-&gt; DataFrameReader.csv(filePath)</td>
<td class="org-left">-&gt; DataFrameReader.csv(filePath)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">-&gt; DataFrame.show():Unit</td>
<td class="org-left">-&gt; DataFrame.show():Unit</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">-&gt; DataFrame.schema</td>
<td class="org-left">-&gt; DataFrame.schema</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">-&gt; StructType.printTreeString:Unit</td>
<td class="org-left">-&gt; StructType.printTreeString:Unit</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">sc.stop</td>
<td class="org-left">bd.stop</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-scala"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">SparkSeesion</span>
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">spark</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">SparkSession</span>
  .builder()
  .master(<span style="color: #2d9574;">"local[*]"</span>)
  .appName(<span style="color: #2d9574;">"NOAA Data"</span>)
  .getOrCreate()

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">SparkContext</span>
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">sc</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">SparkContext</span>(<span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">SparkConf</span>()
                            .setAppName(<span style="color: #2d9574;">"Temp Data"</span>)
                            .setMaster(<span style="color: #2d9574;">"local[*]"</span>))
</pre>
</div>
</div>
</div>
