BIG-28.org
** DataFrame.show()
   #+BEGIN_EXAMPLE
   US1MNHN0184,20170101,PRCP,0,,,N,
   US1MNHN0184,20170101,SNOW,0,,,N,
   US1MNHN0184,20170101,SNWD,274,,,N,
   CA1MB000296,20170101,PRCP,0,,,N,
   US1MNCV0008,20170101,PRCP,0,,,N,
   US1MNCV0008,20170101,SNOW,0,,,N,
   ASN00015643,20170101,TMAX,274,,,a,
   ASN00015643,20170101,TMIN,218,,,a,
   ASN00015643,20170101,PRCP,2,,,a,
   US1MISW0005,20170101,PRCP,0,,,N,
   US1MISW0005,20170101,SNOW,0,,,N,
   US1MISW0005,20170101,SNWD,0,,,N,
   ASN00085296,20170101,TMAX,217,,,a,
   ASN00085296,20170101,TMIN,127,,,a
   #+END_EXAMPLE

   DataFrame.show will get a table below:

   #+BEGIN_EXAMPLE
   [info] +-----------+--------+----+---+----+----+---+----+
   [info] |        _c0|     _c1| _c2|_c3| _c4| _c5|_c6| _c7|
   [info] +-----------+--------+----+---+----+----+---+----+
   [info] |US1MNHN0184|20170101|PRCP|  0|null|null|  N|null|
   [info] |US1MNHN0184|20170101|SNOW|  0|null|null|  N|null|
   [info] |US1MNHN0184|20170101|SNWD|274|null|null|  N|null|
   [info] |CA1MB000296|20170101|PRCP|  0|null|null|  N|null|
   [info] |US1MNCV0008|20170101|PRCP|  0|null|null|  N|null|
   [info] |US1MNCV0008|20170101|SNOW|  0|null|null|  N|null|
   [info] |ASN00015643|20170101|TMAX|274|null|null|  a|null|
   [info] |ASN00015643|20170101|TMIN|218|null|null|  a|null|
   [info] |ASN00015643|20170101|PRCP|  2|null|null|  a|null|
   [info] |US1MISW0005|20170101|PRCP|  0|null|null|  N|null|
   [info] |US1MISW0005|20170101|SNOW|  0|null|null|  N|null|
   [info] |US1MISW0005|20170101|SNWD|  0|null|null|  N|null|
   [info] |ASN00085296|20170101|TMAX|217|null|null|  a|null|
   [info] |ASN00085296|20170101|TMIN|127|null|null|  a|null|
   [info] |ASN00085296|20170101|PRCP|  0|null|null|  a|null|
   [info] |US1MAMD0069|20170101|PRCP| 56|null|null|  N|null|
   [info] |ASN00040209|20170101|TMAX|293|null|null|  a|null|
   [info] |ASN00040209|20170101|TMIN|250|null|null|  a|null|
   [info] |ASN00040209|20170101|PRCP|  0|null|null|  a|null|
   [info] |ASN00085280|20170101|TMAX|215|null|null|  a|null|
   [info] +-----------+--------+----+---+----+----+---+----+
   #+END_EXAMPLE

** DataFrame.schema and option

   #+BEGIN_EXAMPLE
   customize your own schema, specifing how to read data from souce and how to save it
                                        ---------------------------     --------------
                                                option                       scehma
                                        ----------------------------------------------
                                                          drf
   #+END_EXAMPLE

   #+BEGIN_EXAMPLE
   - df : DataFrame
   - ss : SparkSession
   - dfr: DataFrameReader

   ss. *read* => dfr .schema(StructType). => dfr .option() => drf .read => drf . *csv* => df
   ----------    ---------------------------------------------------------------------    -----
   ss                                        dfr                                          df
   #+END_EXAMPLE

   #+BEGIN_SRC scala
     object implicits extends SQLImplicits with Serializable
     // (Scala-specific) Implicit methods available in Scala for converting common Scala objects into DataFrames.
     def schema: StructType
       // Returns the schema of this Dataset.
   #+END_SRC

   ~schema~ gives us more information(~StructType~) about what data is being stored and what it looks like.

*** we can have multiple ~option~ s
    #+BEGIN_SRC scala
    val countyData = spark.read.option("header", true).option("delimiter", "\t").csv("data/la.data.64.County")
    #+END_SRC


** df.select()

   #+BEGIN_SRC scala
     def select(col: String, cols: String*): DataFrame
     // Selects a set of columns.
   #+END_SRC

   Note that this method can used to *produce new column* by the existed columns, in a way of *element-vise* computing.


    | sid |     date | tmax | tmin |
    |-----+----------+------+------|
    |   1 | 20170101 |   30 |   10 |
    |   1 | 20170101 |   40 |   10 |
    |   1 | 20170101 |   32 |   10 |
    |   1 | 20170101 |   10 |   10 |
    |   1 | 20170101 |   50 |   10 |

    ~averageTemp2017 = combinedTemps2017.select('sid, 'date, ('tmax + 'tmin)/2)~

    get the table below:

    | sid |     date | (tmax + tmin)/2 |
    |-----+----------+-----------------|
    |   1 | 20170101 |              20 |
    |   1 | 20170101 |              25 |
    |   1 | 20170101 |              21 |
    |   1 | 20170101 |              10 |
    |   1 | 20170101 |              30 |


** DataFrame.limit(n)
   #+BEGIN_SRC scala
   def limit(n: Int): Dataset[T]
   //Returns a new Dataset by taking the first n rows.
   #+END_SRC
   Usfull when your dataset is too large, and you want to try your code.
