BIG-28.html
<div id="org62cb16f" class="outline-3">
<h3 id="org62cb16f">DataFrame.show()</h3>
<div class="outline-text-3" id="text-org62cb16f">
<pre class="example">
US1MNHN0184,20170101,PRCP,0,,,N,
US1MNHN0184,20170101,SNOW,0,,,N,
US1MNHN0184,20170101,SNWD,274,,,N,
CA1MB000296,20170101,PRCP,0,,,N,
US1MNCV0008,20170101,PRCP,0,,,N,
US1MNCV0008,20170101,SNOW,0,,,N,
ASN00015643,20170101,TMAX,274,,,a,
ASN00015643,20170101,TMIN,218,,,a,
ASN00015643,20170101,PRCP,2,,,a,
US1MISW0005,20170101,PRCP,0,,,N,
US1MISW0005,20170101,SNOW,0,,,N,
US1MISW0005,20170101,SNWD,0,,,N,
ASN00085296,20170101,TMAX,217,,,a,
ASN00085296,20170101,TMIN,127,,,a
</pre>

<p>
DataFrame.show will get a table below:
</p>

<pre class="example">
[info] +-----------+--------+----+---+----+----+---+----+
[info] |        _c0|     _c1| _c2|_c3| _c4| _c5|_c6| _c7|
[info] +-----------+--------+----+---+----+----+---+----+
[info] |US1MNHN0184|20170101|PRCP|  0|null|null|  N|null|
[info] |US1MNHN0184|20170101|SNOW|  0|null|null|  N|null|
[info] |US1MNHN0184|20170101|SNWD|274|null|null|  N|null|
[info] |CA1MB000296|20170101|PRCP|  0|null|null|  N|null|
[info] |US1MNCV0008|20170101|PRCP|  0|null|null|  N|null|
[info] |US1MNCV0008|20170101|SNOW|  0|null|null|  N|null|
[info] |ASN00015643|20170101|TMAX|274|null|null|  a|null|
[info] |ASN00015643|20170101|TMIN|218|null|null|  a|null|
[info] |ASN00015643|20170101|PRCP|  2|null|null|  a|null|
[info] |US1MISW0005|20170101|PRCP|  0|null|null|  N|null|
[info] |US1MISW0005|20170101|SNOW|  0|null|null|  N|null|
[info] |US1MISW0005|20170101|SNWD|  0|null|null|  N|null|
[info] |ASN00085296|20170101|TMAX|217|null|null|  a|null|
[info] |ASN00085296|20170101|TMIN|127|null|null|  a|null|
[info] |ASN00085296|20170101|PRCP|  0|null|null|  a|null|
[info] |US1MAMD0069|20170101|PRCP| 56|null|null|  N|null|
[info] |ASN00040209|20170101|TMAX|293|null|null|  a|null|
[info] |ASN00040209|20170101|TMIN|250|null|null|  a|null|
[info] |ASN00040209|20170101|PRCP|  0|null|null|  a|null|
[info] |ASN00085280|20170101|TMAX|215|null|null|  a|null|
[info] +-----------+--------+----+---+----+----+---+----+
</pre>
</div>
</div>

<div id="orge9d7522" class="outline-3">
<h3 id="orge9d7522">DataFrame.schema and option</h3>
<div class="outline-text-3" id="text-orge9d7522">
<p>
customize your own schema, specifing how to read data from souce and how to save it
                                     ----------------------&#x2013;&#x2014;     ---------&#x2013;&#x2014;
                                             option                       scehma
</p>
<hr />
<p>
drf
</p>

<pre class="example">
- df : DataFrame
- ss : SparkSession
- dfr: DataFrameReader

ss. *read* =&gt; dfr .schema(StructType). =&gt; dfr .option() =&gt; drf .read =&gt; drf . *csv* =&gt; df
----------    ---------------------------------------------------------------------    -----
ss                                        dfr                                          df
</pre>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">object</span> <span style="color: #a45bad;">implicits</span> <span style="color: #4f97d7; font-weight: bold;">extends</span> <span style="color: #ce537a; font-weight: bold;">SQLImplicits</span> <span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #ce537a; font-weight: bold;">Serializable</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">(Scala-specific) Implicit methods available in Scala for converting common Scala objects into DataFrames.</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">schema</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">StructType</span>
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Returns the schema of this Dataset.</span>
</pre>
</div>

<p>
<code>schema</code> gives us more information(<code>StructType</code>) about what data is being stored and what it looks like.
</p>
</div>

<div id="orge7d3734" class="outline-4">
<h4 id="orge7d3734">we can have multiple <code>option</code> s</h4>
<div class="outline-text-4" id="text-orge7d3734">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">countyData</span> <span style="color: #4f97d7; font-weight: bold;">=</span> spark.read.option(<span style="color: #2d9574;">"header"</span>, <span style="color: #a45bad;">true</span>).option(<span style="color: #2d9574;">"delimiter"</span>, <span style="color: #2d9574;">"</span><span style="color: #a45bad;">\t</span><span style="color: #2d9574;">"</span>).csv(<span style="color: #2d9574;">"data/la.data.64.County"</span>)
</pre>
</div>
</div>
</div>
</div>


<div id="orgd24b8f3" class="outline-3">
<h3 id="orgd24b8f3">df.select()</h3>
<div class="outline-text-3" id="text-orgd24b8f3">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">select</span>(col<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">String</span>, cols<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">String</span>*)<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">DataFrame</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Selects a set of columns.</span>
</pre>
</div>

<p>
Note that this method can used to <b>produce new column</b> by the existed columns, in a way of <b>element-vise</b> computing.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">sid</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">tmax</th>
<th scope="col" class="org-right">tmin</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">30</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">40</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">32</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">10</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">50</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>

<p>
<code>averageTemp2017 = combinedTemps2017.select('sid, 'date, ('tmax + 'tmin)/2)</code>
</p>

<p>
get the table below:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">sid</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">(tmax + tmin)/2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">25</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">21</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">30</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="org60ca4b0" class="outline-3">
<h3 id="org60ca4b0">DataFrame.limit(n)</h3>
<div class="outline-text-3" id="text-org60ca4b0">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">limit</span>(n<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Int</span>)<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Dataset</span>[<span style="color: #a45bad;">T</span>]
<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Returns a new Dataset by taking the first n rows.</span>
</pre>
</div>
<p>
Usfull when your dataset is too large, and you want to try your code.
</p>
</div>
</div>
