BIG-28.org
** DataFrame.join(df, Seq(column1, column2, ...))

   +-----------+----------+------+
   |        sid|      date|  tmax|
   +-----------+----------+------+
   |ASN00015643|2017-01-01| 218.0|
   |ASN00085296|2017-01-01| 127.0|
   |ASN00040209|2017-01-01| 250.0|
   |CA005030984|2017-01-01|-192.0|
   +-----------+----------+------+

   +-----------+----------+------+
   |        sid|      date|  tmin|
   +-----------+----------+------+
   |ASN00015643|2017-01-01| 218.0|
   |ASN00085296|2017-01-01| 127.0|
   |ASN00040209|2017-01-01| 250.0|
   |ASN00085280|2017-01-01| 156.0|
   +-----------+----------+------+


   3 methods for joining DataFrames, separately for join one-column or join multiple-columns
   #+BEGIN_SRC scala
     def join(right: Dataset[_], usingColumns: Seq[String]): DataFrame
       //Inner equi-join with another DataFrame using the given columns.
   #+END_SRC

   #+BEGIN_SRC scala
     val combinedTemps2017 = tmax2017.join(tmin2017,
                                           tmax2017("sid") === tmin2017("sid") &&
                                             tmax2017("date") === tmin2017("date"))
   #+END_SRC

   *column appending*: code above will give table like *column appending*

   | sid1 | date1 | ... | sid2 | date2 | ... |
   |------+-------+-----+------+-------+-----|
   |      |       |     |      |       |     |


   #+BEGIN_SRC scala
     val combinedTemps2017 = tmax2017.join(tmin2017, Seq("sid", "date"))
   #+END_SRC

   *column mix in*: code above will give table like *mix in*

   | sid | date | ... |
   |-----+------+-----|
   |     |      |     |


** DataFrame( or called DataSet[Column])
   #+BEGIN_EXAMPLE
   original DataFrame(DataSet[Column])
   [info] +-----------+----------+-----+-----+
   [info] |        sid|      data|mtype|value|
   [info] +-----------+----------+-----+-----+
   [info] |US1MNHN0184|2017-01-01| PRCP|  0.0|
   [info] |US1MNHN0184|2017-01-01| SNOW|  0.0|
   [info] |US1MNHN0184|2017-01-01| SNWD|274.0|
   [info] |CA1MB000296|2017-01-01| PRCP|  0.0|
   [info] |US1MNCV0008|2017-01-01| PRCP|  0.0|
   [info] |US1MNCV0008|2017-01-01| SNOW|  0.0|
   [info] |ASN00015643|2017-01-01| TMAX|274.0|
   [info] |ASN00015643|2017-01-01| TMIN|218.0|
   [info] |ASN00015643|2017-01-01| PRCP|  2.0|
   [info] |US1MISW0005|2017-01-01| PRCP|  0.0|
   [info] |US1MISW0005|2017-01-01| SNOW|  0.0|
   [info] |US1MISW0005|2017-01-01| SNWD|  0.0|
   [info] |ASN00085296|2017-01-01| TMAX|217.0|
   [info] |ASN00085296|2017-01-01| TMIN|127.0|
   [info] |ASN00085296|2017-01-01| PRCP|  0.0|
   [info] |US1MAMD0069|2017-01-01| PRCP| 56.0|
   [info] |ASN00040209|2017-01-01| TMAX|293.0|
   [info] |ASN00040209|2017-01-01| TMIN|250.0|
   [info] |ASN00040209|2017-01-01| PRCP|  0.0|
   [info] |ASN00085280|2017-01-01| TMAX|215.0|
   [info] +-----------+----------+-----+-----+

   #+END_EXAMPLE
** DataFrame after filter mtype by "TMAX"
   ~val tmax2017 = data2017.filter('mtype === "TMAX")~
   #+BEGIN_EXAMPLE
   [info] +-----------+----------+-----+------+
   [info] |        sid|      data|mtype| value|
   [info] +-----------+----------+-----+------+
   [info] |ASN00015643|2017-01-01| TMAX| 274.0|
   [info] |ASN00085296|2017-01-01| TMAX| 217.0|
   [info] |ASN00040209|2017-01-01| TMAX| 293.0|
   [info] |ASN00085280|2017-01-01| TMAX| 215.0|
   [info] |CA005030984|2017-01-01| TMAX|-109.0|
   [info] |CA003076680|2017-01-01| TMAX| -85.0|
   [info] |CA003072151|2017-01-01| TMAX|-100.0|
   [info] |CA003031094|2017-01-01| TMAX| -79.0|
   [info] |ASN00068151|2017-01-01| TMAX| 254.0|
   [info] |USW00003889|2017-01-01| TMAX| 100.0|
   [info] |USW00003967|2017-01-01| TMAX|  72.0|
   [info] |USW00004131|2017-01-01| TMAX| -85.0|
   [info] |USW00012842|2017-01-01| TMAX| 272.0|
   [info] |USW00012876|2017-01-01| TMAX| 278.0|
   [info] |USW00014719|2017-01-01| TMAX|  89.0|
   [info] |USW00024061|2017-01-01| TMAX| -77.0|
   [info] |USW00024229|2017-01-01| TMAX|  44.0|
   [info] |USW00094626|2017-01-01| TMAX|  11.0|
   [info] |USW00003048|2017-01-01| TMAX| 105.0|
   [info] |USS0018F01S|2017-01-01| TMAX| -34.0|
   [info] +-----------+----------+-----+------+

   #+END_EXAMPLE

** DataFrame after filter mtype by "TMIN"
   val tmin2017 = data2017.filter('mtype === "Tmin")
   [info] +-----------+----------+-----+------+
   [info] |        sid|      data|mtype| value|
   [info] +-----------+----------+-----+------+
   [info] |ASN00015643|2017-01-01| TMAX| 274.0|
   [info] |ASN00085296|2017-01-01| TMAX| 217.0|
   [info] |ASN00040209|2017-01-01| TMAX| 293.0|
   [info] |ASN00085280|2017-01-01| TMAX| 215.0|
   [info] |CA005030984|2017-01-01| TMAX|-109.0|
   [info] |CA003076680|2017-01-01| TMAX| -85.0|
   [info] |CA003072151|2017-01-01| TMAX|-100.0|
   [info] |CA003031094|2017-01-01| TMAX| -79.0|
   [info] |ASN00068151|2017-01-01| TMAX| 254.0|
   [info] |USW00003889|2017-01-01| TMAX| 100.0|
   [info] |USW00003967|2017-01-01| TMAX|  72.0|
   [info] |USW00004131|2017-01-01| TMAX| -85.0|
   [info] |USW00012842|2017-01-01| TMAX| 272.0|
   [info] |USW00012876|2017-01-01| TMAX| 278.0|
   [info] |USW00014719|2017-01-01| TMAX|  89.0|
   [info] |USW00024061|2017-01-01| TMAX| -77.0|
   [info] |USW00024229|2017-01-01| TMAX|  44.0|
   [info] |USW00094626|2017-01-01| TMAX|  11.0|
   [info] |USW00003048|2017-01-01| TMAX| 105.0|
   [info] |USS0018F01S|2017-01-01| TMAX| -34.0|
   [info] +-----------+----------+-----+------+
