BIG-28.html
<div id="org22506f6" class="outline-3">
<h3 id="org22506f6">DataFrame.join(df, Seq(column1, column2, &#x2026;))</h3>
<div class="outline-text-3" id="text-org22506f6">
<!-- This HTML table template is generated by emacs 26.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;sid
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;date
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;tmax
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      ASN00015643<br />
      ASN00085296<br />
      ASN00040209<br />
      CA005030984
    </td>
    <td align="left" valign="top">
      2017-01-01<br />
      2017-01-01<br />
      2017-01-01<br />
      2017-01-01
    </td>
    <td align="left" valign="top">
      &nbsp;218.0<br />
      &nbsp;127.0<br />
      &nbsp;250.0<br />
      -192.0
    </td>
  </tr>
</table>

<!-- This HTML table template is generated by emacs 26.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;sid
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;date
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;tmin
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      ASN00015643<br />
      ASN00085296<br />
      ASN00040209<br />
      ASN00085280
    </td>
    <td align="left" valign="top">
      2017-01-01<br />
      2017-01-01<br />
      2017-01-01<br />
      2017-01-01
    </td>
    <td align="left" valign="top">
      &nbsp;218.0<br />
      &nbsp;127.0<br />
      &nbsp;250.0<br />
      &nbsp;156.0
    </td>
  </tr>
</table>


<p>
3 methods for joining DataFrames, separately for join one-column or join multiple-columns
</p>
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">join</span>(right<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Dataset</span>[<span style="color: #4f97d7; font-weight: bold;">_</span>], usingColumns<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Seq</span>[<span style="color: #a45bad;">String</span>])<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">DataFrame</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">Inner equi-join with another DataFrame using the given columns.</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">combinedTemps2017</span> <span style="color: #4f97d7; font-weight: bold;">=</span> tmax2017.join(tmin2017,
                                      tmax2017(<span style="color: #2d9574;">"sid"</span>) === tmin2017(<span style="color: #2d9574;">"sid"</span>) &amp;&amp;
                                        tmax2017(<span style="color: #2d9574;">"date"</span>) === tmin2017(<span style="color: #2d9574;">"date"</span>))
</pre>
</div>

<p>
<b>column appending</b>: code above will give table like <b>column appending</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sid1</th>
<th scope="col" class="org-left">date1</th>
<th scope="col" class="org-left">&#x2026;</th>
<th scope="col" class="org-left">sid2</th>
<th scope="col" class="org-left">date2</th>
<th scope="col" class="org-left">&#x2026;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">combinedTemps2017</span> <span style="color: #4f97d7; font-weight: bold;">=</span> tmax2017.join(tmin2017, <span style="color: #a45bad;">Seq</span>(<span style="color: #2d9574;">"sid"</span>, <span style="color: #2d9574;">"date"</span>))
</pre>
</div>

<p>
<b>column mix in</b>: code above will give table like <b>mix in</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">sid</th>
<th scope="col" class="org-left">date</th>
<th scope="col" class="org-left">&#x2026;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="orgb4b9d39" class="outline-3">
<h3 id="orgb4b9d39">DataFrame( or called DataSet[Column])</h3>
<div class="outline-text-3" id="text-orgb4b9d39">
<p>
original DataFrame(DataSet[Column])
[info] <del>-----------</del>----------<del>-----</del>&#x2013;&#x2014;+
[info] |        sid|      data|mtype|value|
[info] <del>-----------</del>----------<del>-----</del>&#x2013;&#x2014;+
[info] |US1MNHN0184|2017-01-01| PRCP|  0.0|
[info] |US1MNHN0184|2017-01-01| SNOW|  0.0|
[info] |US1MNHN0184|2017-01-01| SNWD|274.0|
[info] |CA1MB000296|2017-01-01| PRCP|  0.0|
[info] |US1MNCV0008|2017-01-01| PRCP|  0.0|
[info] |US1MNCV0008|2017-01-01| SNOW|  0.0|
[info] |ASN00015643|2017-01-01| TMAX|274.0|
[info] |ASN00015643|2017-01-01| TMIN|218.0|
[info] |ASN00015643|2017-01-01| PRCP|  2.0|
[info] |US1MISW0005|2017-01-01| PRCP|  0.0|
[info] |US1MISW0005|2017-01-01| SNOW|  0.0|
[info] |US1MISW0005|2017-01-01| SNWD|  0.0|
[info] |ASN00085296|2017-01-01| TMAX|217.0|
[info] |ASN00085296|2017-01-01| TMIN|127.0|
[info] |ASN00085296|2017-01-01| PRCP|  0.0|
[info] |US1MAMD0069|2017-01-01| PRCP| 56.0|
[info] |ASN00040209|2017-01-01| TMAX|293.0|
[info] |ASN00040209|2017-01-01| TMIN|250.0|
[info] |ASN00040209|2017-01-01| PRCP|  0.0|
[info] |ASN00085280|2017-01-01| TMAX|215.0|
[info] <del>-----------</del>----------<del>-----</del>&#x2013;&#x2014;+
</p>
</div>
</div>
<div id="org185df00" class="outline-3">
<h3 id="org185df00">DataFrame after filter mtype by "TMAX"</h3>
<div class="outline-text-3" id="text-org185df00">
<p>
<code>val tmax2017 = data2017.filter('mtype === "TMAX")</code>
[info] <del>-----------</del>----------<del>-----</del>-&#x2013;&#x2014;+
[info] |        sid|      data|mtype| value|
[info] <del>-----------</del>----------<del>-----</del>-&#x2013;&#x2014;+
[info] |ASN00015643|2017-01-01| TMAX| 274.0|
[info] |ASN00085296|2017-01-01| TMAX| 217.0|
[info] |ASN00040209|2017-01-01| TMAX| 293.0|
[info] |ASN00085280|2017-01-01| TMAX| 215.0|
[info] |CA005030984|2017-01-01| TMAX|-109.0|
[info] |CA003076680|2017-01-01| TMAX| -85.0|
[info] |CA003072151|2017-01-01| TMAX|-100.0|
[info] |CA003031094|2017-01-01| TMAX| -79.0|
[info] |ASN00068151|2017-01-01| TMAX| 254.0|
[info] |USW00003889|2017-01-01| TMAX| 100.0|
[info] |USW00003967|2017-01-01| TMAX|  72.0|
[info] |USW00004131|2017-01-01| TMAX| -85.0|
[info] |USW00012842|2017-01-01| TMAX| 272.0|
[info] |USW00012876|2017-01-01| TMAX| 278.0|
[info] |USW00014719|2017-01-01| TMAX|  89.0|
[info] |USW00024061|2017-01-01| TMAX| -77.0|
[info] |USW00024229|2017-01-01| TMAX|  44.0|
[info] |USW00094626|2017-01-01| TMAX|  11.0|
[info] |USW00003048|2017-01-01| TMAX| 105.0|
[info] |USS0018F01S|2017-01-01| TMAX| -34.0|
[info] <del>-----------</del>----------<del>-----</del>-&#x2013;&#x2014;+
</p>
</div>
</div>

<div id="org6e8e4b2" class="outline-3">
<h3 id="org6e8e4b2">DataFrame after filter mtype by "TMIN"</h3>
<div class="outline-text-3" id="text-org6e8e4b2">
<p>
val tmin2017 = data2017.filter('mtype <code>=</code> "Tmin")
[info] <del>-----------</del>----------<del>-----</del>-&#x2013;&#x2014;+
[info] |        sid|      data|mtype| value|
[info] <del>-----------</del>----------<del>-----</del>-&#x2013;&#x2014;+
[info] |ASN00015643|2017-01-01| TMAX| 274.0|
[info] |ASN00085296|2017-01-01| TMAX| 217.0|
[info] |ASN00040209|2017-01-01| TMAX| 293.0|
[info] |ASN00085280|2017-01-01| TMAX| 215.0|
[info] |CA005030984|2017-01-01| TMAX|-109.0|
[info] |CA003076680|2017-01-01| TMAX| -85.0|
[info] |CA003072151|2017-01-01| TMAX|-100.0|
[info] |CA003031094|2017-01-01| TMAX| -79.0|
[info] |ASN00068151|2017-01-01| TMAX| 254.0|
[info] |USW00003889|2017-01-01| TMAX| 100.0|
[info] |USW00003967|2017-01-01| TMAX|  72.0|
[info] |USW00004131|2017-01-01| TMAX| -85.0|
[info] |USW00012842|2017-01-01| TMAX| 272.0|
[info] |USW00012876|2017-01-01| TMAX| 278.0|
[info] |USW00014719|2017-01-01| TMAX|  89.0|
[info] |USW00024061|2017-01-01| TMAX| -77.0|
[info] |USW00024229|2017-01-01| TMAX|  44.0|
[info] |USW00094626|2017-01-01| TMAX|  11.0|
[info] |USW00003048|2017-01-01| TMAX| 105.0|
[info] |USS0018F01S|2017-01-01| TMAX| -34.0|
[info] <del>-----------</del>----------<del>-----</del>-&#x2013;&#x2014;+
</p>
</div>
</div>
