BIG-28.org
** DataFrame.describe()
   it will give you many statistical information, a very good way to get a feel of your data ,very convenient.
   - min
   - max
   - average
   - stdev

   #+BEGIN_EXAMPLE
   [info] +-------+-----------+------------------+
   [info] |summary|        sid|              tmin|
   [info] +-------+-----------+------------------+
   [info] |  count|     126171|            126171|
   [info] |   mean|       null|-58.01841944662402|
   [info] | stddev|       null|136.90434799836595|
   [info] |    min|AE000041196|            -733.0|
   [info] |    max|ZI000067983|             319.0|
   [info] +-------+-----------+------------------+
   #+END_EXAMPLE
** df.limit vs. df.drop

   | limit(n)           | delete `n` rows to create a new DataFrame   |
   | drop("columnName") | delete THE column to create a new DataFrame |

   note that *limit(1000000)* vs *limit(10)* has little influence to the computations speed

** df.select vs. df.filter vs. df.join

   df.select more like do produce new column by existed column

   def.filter more like "select" by some condition :)

   | sid |     date | tmax | tmin |
   |-----+----------+------+------|
   |   1 | 20170101 |   30 |   10 |
   |   1 | 20170101 |   40 |   10 |
   |   1 | 20170101 |   32 |   10 |
   |   1 | 20170101 |   10 |   10 |
   |   1 | 20170101 |   50 |   10 |

   ~averageTemp2017 = combinedTemps2017.select('sid, 'date, ('tmax + 'tmin)/2)~

   get the table below:

   | sid |     date | (tmax + tmin)/2 |
   |-----+----------+-----------------|
   |   1 | 20170101 |              20 |
   |   1 | 20170101 |              25 |
   |   1 | 20170101 |              21 |
   |   1 | 20170101 |              10 |
   |   1 | 20170101 |              30 |


   ~val combinedTemps2017 = tmax2017.join(tmin2017, Seq("sid", "date"))~

   +-----------+----------+------+
   |        sid|      date|  tmax|
   +-----------+----------+------+
   |ASN00015643|2017-01-01| 218.0|
   |ASN00085296|2017-01-01| 127.0|
   |ASN00040209|2017-01-01| 250.0|
   |CA005030984|2017-01-01|-192.0|
   +-----------+----------+------+

   +-----------+----------+------+
   |        sid|      date|  tmin|
   +-----------+----------+------+
   |ASN00015643|2017-01-01| 218.0|
   |ASN00085296|2017-01-01| 127.0|
   |ASN00040209|2017-01-01| 250.0|
   |ASN00085280|2017-01-01| 156.0|
   +-----------+----------+------+

   after joining on ("sid", "date")

   | sid |     date | tmax | tmin |
   |-----+----------+------+------|
   |   1 | 20170101 |   30 |   10 |
   |   1 | 20170101 |   40 |   10 |
   |   1 | 20170101 |   32 |   10 |
   |   1 | 20170101 |   10 |   10 |
   |   1 | 20170101 |   50 |   10 |

** df.stat
   #+BEGIN_SRC scala
     def stat: DataFrameStatFunctions
     // return a DataFrameStatFunctions for working statistic functions support
   #+END_SRC

* StructType
** StructType.printTreeString

   ~DataFrame.scheme.printTreeString~ will get tree table below:

   #+BEGIN_EXAMPLE
   [info] root
   [info]  |-- _c0: string (nullable = true)
   [info]  |-- _c1: string (nullable = true)
   [info]  |-- _c2: string (nullable = true)
   [info]  |-- _c3: string (nullable = true)
   [info]  |-- _c4: string (nullable = true)
   [info]  |-- _c5: string (nullable = true)
   [info]  |-- _c6: string (nullable = true)
   [info]  |-- _c7: string (nullable = true)
   #+END_EXAMPLE

** StructType(Array[StructField])
   The default schema(StructType) will see all the columns as type of String,
   but this mabye not what we want. Define a schema and some options to tell
   Spark, what's the StructType inside of this DataFrame

   1. setup a schema for this DataFrame
   2. for some non-standard-format columns in source data file, tell Spark I
      need a special ~DataFrameReader~ to specify what the format is, by
      ~option("dateFormat", "yyyyMMdd")~

   #+NAME: how to define a schema of StructType
   #+BEGIN_SRC scala
     val tschema = StructType(Array( // ONLY select and modify the front 4 columns
                                StructField("sid",StringType),
                                StructField("date",DateType),
                                StructField("mtype",StringType),
                                StructField("value",DoubleType)
                              ))
     // data2017 is a DataFrame
     val data2017 = spark.read.schema(tschema).option("dateFormat", "yyyyMMdd").csv("data/2017.csv")
   #+END_SRC

