BIG-28.html
<div id="org29bd96e" class="outline-3">
<h3 id="org29bd96e">DataFrame.describe()</h3>
<div class="outline-text-3" id="text-org29bd96e">
<p>
it will give you many statistical information, a very good way to get a feel of your data ,very convenient.
</p>
<ul class="org-ul">
<li>min</li>
<li>max</li>
<li>average</li>
<li>stdev</li>
</ul>

<pre class="example">
[info] +-------+-----------+------------------+
[info] |summary|        sid|              tmin|
[info] +-------+-----------+------------------+
[info] |  count|     126171|            126171|
[info] |   mean|       null|-58.01841944662402|
[info] | stddev|       null|136.90434799836595|
[info] |    min|AE000041196|            -733.0|
[info] |    max|ZI000067983|             319.0|
[info] +-------+-----------+------------------+
</pre>
</div>
</div>
<div id="org340c4c5" class="outline-3">
<h3 id="org340c4c5">df.limit vs. df.drop</h3>
<div class="outline-text-3" id="text-org340c4c5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">limit(n)</td>
<td class="org-left">delete `n` rows to create a new DataFrame</td>
</tr>

<tr>
<td class="org-left">drop("columnName")</td>
<td class="org-left">delete THE column to create a new DataFrame</td>
</tr>
</tbody>
</table>

<p>
note that <b>limit(1000000)</b> vs <b>limit(10)</b> has little influence to the computations speed
</p>
</div>
</div>

<div id="orge9d4ad3" class="outline-3">
<h3 id="orge9d4ad3">df.select vs. df.filter vs. df.join</h3>
<div class="outline-text-3" id="text-orge9d4ad3">
<p>
df.select more like do produce new column by existed column
</p>

<p>
def.filter more like "select" by some condition :)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">sid</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">tmax</th>
<th scope="col" class="org-right">tmin</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">30</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">40</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">32</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">10</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">50</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>

<p>
<code>averageTemp2017 = combinedTemps2017.select('sid, 'date, ('tmax + 'tmin)/2)</code>
</p>

<p>
get the table below:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">sid</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">(tmax + tmin)/2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">25</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">21</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">30</td>
</tr>
</tbody>
</table>


<p>
<code>val combinedTemps2017 = tmax2017.join(tmin2017, Seq("sid", "date"))</code>
</p>

<!-- This HTML table template is generated by emacs 26.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;sid
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;date
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;tmax
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      ASN00015643<br />
      ASN00085296<br />
      ASN00040209<br />
      CA005030984
    </td>
    <td align="left" valign="top">
      2017-01-01<br />
      2017-01-01<br />
      2017-01-01<br />
      2017-01-01
    </td>
    <td align="left" valign="top">
      &nbsp;218.0<br />
      &nbsp;127.0<br />
      &nbsp;250.0<br />
      -192.0
    </td>
  </tr>
</table>

<!-- This HTML table template is generated by emacs 26.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;sid
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;date
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;tmin
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      ASN00015643<br />
      ASN00085296<br />
      ASN00040209<br />
      ASN00085280
    </td>
    <td align="left" valign="top">
      2017-01-01<br />
      2017-01-01<br />
      2017-01-01<br />
      2017-01-01
    </td>
    <td align="left" valign="top">
      &nbsp;218.0<br />
      &nbsp;127.0<br />
      &nbsp;250.0<br />
      &nbsp;156.0
    </td>
  </tr>
</table>

<p>
after joining on ("sid", "date")
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">sid</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">tmax</th>
<th scope="col" class="org-right">tmin</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">30</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">40</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">32</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">10</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">50</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="org7924e2b" class="outline-3">
<h3 id="org7924e2b">df.stat</h3>
<div class="outline-text-3" id="text-org7924e2b">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">stat</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">DataFrameStatFunctions</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">return a DataFrameStatFunctions for working statistic functions support</span>
</pre>
</div>
</div>
</div>
</div>

<div id="orgaf8d0e3" class="outline-2">
<h2 id="orgaf8d0e3">StructType</h2>
<div class="outline-text-2" id="text-orgaf8d0e3">
</div>
<div id="org9deb73e" class="outline-3">
<h3 id="org9deb73e">StructType.printTreeString</h3>
<div class="outline-text-3" id="text-org9deb73e">
<p>
<code>DataFrame.scheme.printTreeString</code> will get tree table below:
</p>

<pre class="example">
[info] root
[info]  |-- _c0: string (nullable = true)
[info]  |-- _c1: string (nullable = true)
[info]  |-- _c2: string (nullable = true)
[info]  |-- _c3: string (nullable = true)
[info]  |-- _c4: string (nullable = true)
[info]  |-- _c5: string (nullable = true)
[info]  |-- _c6: string (nullable = true)
[info]  |-- _c7: string (nullable = true)
</pre>
</div>
</div>

<div id="org5ceb814" class="outline-3">
<h3 id="org5ceb814">StructType(Array[StructField])</h3>
<div class="outline-text-3" id="text-org5ceb814">
<p>
The default schema(StructType) will see all the columns as type of String,
but this mabye not what we want. Define a schema and some options to tell
Spark, what's the StructType inside of this DataFrame
</p>

<ol class="org-ol">
<li>setup a schema for this DataFrame</li>
<li>for some non-standard-format columns in source data file, tell Spark I
need a special <code>DataFrameReader</code> to specify what the format is, by
<code>option("dateFormat", "yyyyMMdd")</code></li>
</ol>

<div class="org-src-container">
<pre class="src src-scala" id="org6602dc8"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">tschema</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">StructType</span>(<span style="color: #a45bad;">Array</span>( <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">ONLY select and modify the front 4 columns</span>
                           <span style="color: #a45bad;">StructField</span>(<span style="color: #2d9574;">"sid"</span>,<span style="color: #a45bad;">StringType</span>),
                           <span style="color: #a45bad;">StructField</span>(<span style="color: #2d9574;">"date"</span>,<span style="color: #a45bad;">DateType</span>),
                           <span style="color: #a45bad;">StructField</span>(<span style="color: #2d9574;">"mtype"</span>,<span style="color: #a45bad;">StringType</span>),
                           <span style="color: #a45bad;">StructField</span>(<span style="color: #2d9574;">"value"</span>,<span style="color: #a45bad;">DoubleType</span>)
                         ))
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">data2017 is a DataFrame</span>
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">data2017</span> <span style="color: #4f97d7; font-weight: bold;">=</span> spark.read.schema(tschema).option(<span style="color: #2d9574;">"dateFormat"</span>, <span style="color: #2d9574;">"yyyyMMdd"</span>).csv(<span style="color: #2d9574;">"data/2017.csv"</span>)
</pre>
</div>
</div>
</div>
</div>
