BIG-28.org
* Column
    ~DataFrame.filter~
  #+BEGIN_SRC scala
    def filter(condition: Column): DataSet[T]
  #+END_SRC

  A *Column* is just a column like its name hint. It's computed based on the
  data in *DataFrame*.

** Column construction
  A new *Column* can be constructed based on the input columns present in a
  *DataFrame*

  | kinds of Column                             | methods                      |
  |---------------------------------------------+------------------------------|
  | a specific column get from binded DataFrame | [DataFrameObj]("columnName") |
  | a generic column no bind with a DataFrame   | col("columnName")            |
  | extract a struct field                      | col("columnName.field")      |
  | scala short hand for a named column         | $"columnName"                |
  |                                             | 'columnName                  |

  ~'columnName~ will convert to a Column by implicit conversion:

  #+BEGIN_SRC scala
    val tmax2017 = data2017.filter($"mtype" === "TMAX")
    val tmin2017 = data2017.filter('mtype === "TMIN")
  #+END_SRC

** Column operations
*** return ~Column~
    good for expression composition, because

    ~Column '+' Column = Column '===' = Column '*' = Column~

    #+BEGIN_EXAMPLE
   | +   |   | return a new Column |
   | -   |   | return a new Column |
   | *   |   | return a new Column |
   | /   |   | return a new Column |
   | <   |   | return a new Column |
   | >   |   | return a new Column |
   | === |   | return a new Column |
   | <=> |   | return a new Column |
   | =!= |   | return a new Column |
    #+END_EXAMPLE

   even ~===~ return the Column, BTW, === can be used to ~Any~ type, so, Column
   === value or Column === Column both right

   ~data2017.filter('mtype === "TMAX")~
   ~df.filter( df("colA") === df("colB") )~


   #+BEGIN_SRC scala
   // The following are equivalent:
   peopleDf.filter($"age" > 15)
   peopleDf.where($"age" > 15)
   peopleDf($"age" > 15)
   #+END_SRC

*** element-vise
   all these methods are apply to element-vise of two columns
   like:

   #+BEGIN_SRC scala
     averageTemp2017 = combinedTemps2017.select('sid, 'date, ('tmax + 'tmin)/2)
   #+END_SRC

   | sid |     date | tmax | tmin |
   |-----+----------+------+------|
   |   1 | 20170101 |   30 |   10 |
   |   1 | 20170101 |   40 |   10 |
   |   1 | 20170101 |   32 |   10 |
   |   1 | 20170101 |   10 |   10 |
   |   1 | 20170101 |   50 |   10 |

   get the table below:

   | sid |     date | (tmax + tmin)/2 |
   |-----+----------+-----------------|
   |   1 | 20170101 |              20 |
   |   1 | 20170101 |              25 |
   |   1 | 20170101 |              21 |
   |   1 | 20170101 |              10 |
   |   1 | 20170101 |              30 |

* DataFrameStatFunctions
** from DataFrame to DataFrameStatFunctions
   #+BEGIN_SRC scala
     def stat: DataFrameStatFunctions
     // return a DataFrameStatFunctions for working statistic functions support
   #+END_SRC
** API intro
  provide some fucntions about *statistics*

  - ~median~ (50%)
  - ~approxQuantile~ (25%)
  - ~corr~
    - correlation coefficient of two column (important for DS area)
    - helpful for comparing two things to see if they're strongly correlated with
  - ~cov~
    - covariance
  - ~crosstab~
    - a pair-wise frequency table of the given columns

* org.apache.spark.sql.functions
  This is an ~object~, huge many methods inside of it.
  - methods for *aggregation*
  - methods for *date*
  - methods for *mathematics*
  - etc

  So, many time you will ~import org.apache.spark.sql.fucntions._~
