BIG-28.html

<div id="org301e883" class="outline-2">
<h2 id="org301e883">Column</h2>
<div class="outline-text-2" id="text-org301e883">
<p>
DataFrame.filter
</p>
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">filter</span>(condition<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Column</span>)<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">DataSet</span>[<span style="color: #a45bad;">T</span>]
</pre>
</div>

<p>
A <b>Column</b> is just a column like its name hint. It's computed based on the
data in <b>DataFrame</b>.
</p>
</div>

<div id="orgab9b015" class="outline-3">
<h3 id="orgab9b015">Column construction</h3>
<div class="outline-text-3" id="text-orgab9b015">
<p>
A new <b>Column</b> can be constructed based on the input columns present in a
<b>DataFrame</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">kinds of Column</th>
<th scope="col" class="org-left">methods</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a specific column get from binded DataFrame</td>
<td class="org-left">[DataFrameObj]("columnName")</td>
</tr>

<tr>
<td class="org-left">a generic column no bind with a DataFrame</td>
<td class="org-left">col("columnName")</td>
</tr>

<tr>
<td class="org-left">extract a struct field</td>
<td class="org-left">col("columnName.field")</td>
</tr>

<tr>
<td class="org-left">scala short hand for a named column</td>
<td class="org-left">$"columnName"</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">'columnName</td>
</tr>
</tbody>
</table>

<p>
<code>'columnName</code> will convert to a Column by implicit conversion:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">tmax2017</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data2017.filter($<span style="color: #2d9574;">"mtype"</span> === <span style="color: #2d9574;">"TMAX"</span>)
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">tmin2017</span> <span style="color: #4f97d7; font-weight: bold;">=</span> data2017.filter(<span style="color: #2d9574;">'mtype</span> === <span style="color: #2d9574;">"TMIN"</span>)
</pre>
</div>
</div>
</div>

<div id="org7859bfe" class="outline-3">
<h3 id="org7859bfe">Column operations</h3>
<div class="outline-text-3" id="text-org7859bfe">
</div>
<div id="org3367e75" class="outline-4">
<h4 id="org3367e75">return <code>Column</code></h4>
<div class="outline-text-4" id="text-org3367e75">
<p>
good for expression composition, because
</p>

<p>
<code>Column '+' Column = Column '===' = Column '*' = Column</code>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">+</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">return a new Column</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">return a new Column</td>
</tr>

<tr>
<td class="org-left">*</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">return a new Column</td>
</tr>

<tr>
<td class="org-left">&lt;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">return a new Column</td>
</tr>

<tr>
<td class="org-left">&gt;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">return a new Column</td>
</tr>

<tr>
<td class="org-left"><code>=</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">return a new Column</td>
</tr>

<tr>
<td class="org-left">&lt;=&gt;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">return a new Column</td>
</tr>

<tr>
<td class="org-left"><code>!</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">return a new Column</td>
</tr>
</tbody>
</table>

<p>
even <code>===</code> return the Column, BTW, <code>=</code> can be used to <code>Any</code> type, so, Column <code>=</code> value or Column <code>=</code> Column both right
</p>

<p>
<code>data2017.filter('mtype === "TMAX")</code>
<code>df.filter( df("colA") === df("colB") )</code>
</p>

<p>
// The following are equivalent:
</p>

<p>
peopleDf.filter(\("age" > 15)
   peopleDf.where(\)"age" &gt; 15)
peopleDf($"age" &gt; 15)
</p>
</div>
</div>

<div id="org2a237d9" class="outline-4">
<h4 id="org2a237d9">element-vise</h4>
<div class="outline-text-4" id="text-org2a237d9">
<p>
all these methods are apply to element-vise of two columns
like:
</p>

<div class="org-src-container">
<pre class="src src-scala">averageTemp2017 <span style="color: #4f97d7; font-weight: bold;">=</span> combinedTemps2017.select(<span style="color: #2d9574;">'sid</span>, <span style="color: #2d9574;">'date</span>, (<span style="color: #2d9574;">'tmax</span> + <span style="color: #2d9574;">'tmin</span>)/<span style="color: #a45bad;">2</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">sid</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">tmax</th>
<th scope="col" class="org-right">tmin</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">30</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">40</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">32</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">10</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">50</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>

<p>
get the table below:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">sid</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">(tmax + tmin)/2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">25</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">21</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">20170101</td>
<td class="org-right">30</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="org3683f0e" class="outline-2">
<h2 id="org3683f0e">DataFrameStatFunctions</h2>
<div class="outline-text-2" id="text-org3683f0e">
</div>
<div id="org46b13ba" class="outline-3">
<h3 id="org46b13ba">from DataFrame to DataFrameStatFunctions</h3>
<div class="outline-text-3" id="text-org46b13ba">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">stat</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">DataFrameStatFunctions</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">return a DataFrameStatFunctions for working statistic functions support</span>
</pre>
</div>
</div>
</div>
<div id="org3ceb12b" class="outline-3">
<h3 id="org3ceb12b">API intro</h3>
<div class="outline-text-3" id="text-org3ceb12b">
<p>
provide some fucntions about <b>statistics</b>
</p>

<ul class="org-ul">
<li><code>median</code> (50%)</li>
<li><code>approxQuantile</code> (25%)</li>
<li><code>corr</code>
<ul class="org-ul">
<li>correlation coefficient of two column (important for DS area)</li>
<li>helpful for comparing two things to see if they're strongly correlated with</li>
</ul></li>
<li><code>cov</code>
<ul class="org-ul">
<li>covariance</li>
</ul></li>
<li><code>crosstab</code>
<ul class="org-ul">
<li>a pair-wise frequency table of the given columns</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="org9559f8d" class="outline-2">
<h2 id="org9559f8d">org.apache.spark.sql.functions</h2>
<div class="outline-text-2" id="text-org9559f8d">
<p>
This is an <code>object</code>, huge many methods inside of it.
</p>
<ul class="org-ul">
<li>methods for <b>aggregation</b></li>
<li>methods for <b>date</b></li>
<li>methods for <b>mathematics</b></li>
<li>etc</li>
</ul>

<p>
So, many time you will <code>import org.apache.spark.sql.fucntions._</code>
</p>
</div>
</div>
</div>
</body>
</html>
